# ComputeNormal Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..ComputeNormal Method
Face Class See Also
---
Returns the normal vector for the face at the given point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ ComputeNormal(
	UV point
)
```

Visual Basic
---
```text
Public Function ComputeNormal ( _
	point As UV _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ ComputeNormal(
	UV^ point
)
```

# ### Parameters
point
    Type: Autodesk.Revit.DB..::..UVThe parameters to be evaluated, in natural parameterization of the face.
# ### Return Value
The normal vector. This vector will be normalized.
# Remarks
Differs from the normal returned from ComputeDerivatives(UV) in that this vector is the "face normal" vector. It will always be oriented to point out of a solid that contains the face.
# See Also
Face Class
Autodesk.Revit.DB Namespace